[
  {
    "title": "Shipping Impact on Climate and Sea Levels",
    "description": "Conducted data intergration across multiple datasets and analyzed how CO2 emissions from shipping contribute to climate change and rising sea levels and Interactive Streamlit dashboard with Ai section for detailed analysis.",
    "tools": ["Python", "Streamlit", "Pandas", "OpenAI"],
    "link": "https://claire-namusoke-climate-analysis-dashboard-xj1kim.streamlit.app/"
  },
  {
    "title": "Global Crude Oil Trade",
    "description": "Analysed the the historical patterns of Crude oil Trade,showcasing how dominant exporters and importers became big players while setting a stage for deeper insights into global energy logistics. Built a Streamlit dashboard analyzing global crude oil trade using Python and OpenAI integration for smart and natural language  insights.",
    "tools": ["Python", "Streamlit", "Pandas", "OpenAI"],
    "link": "https://claire-namusoke-crude-oil-trade-crude-oil-zotgyj.streamlit.app/"
  },
  {
    "title": "COVID-19 Dashboard",
    "description": "This project analyzes real-world COVID-19 data to uncover trends in infection rates, mortality, and recovery across different regions and time periods providing a comprehensive view of the pandemic's progression from 2020 to June 2025.",
    "tools": ["Power BI", "DAX", "Data Modeling"],
    "link": "https://app.powerbi.com/groups/me/reports/5c7f2d26-b647-45f7-800e-927d98f819b2/bf11137bdd4ccaded107?experience=power-bi"
  },
  {
    "title": "Afro Couture Sales Dashboard",
    "description": "This Project provides a comprehensive analysis of Afro Couture Natural Salon sales performance in December 2023 with a focus on business performance, employee productivity, and customer satisfaction for that specific month since it is consiidered to be the busiest month of the year according to historical data.",
    "tools": ["Power BI", "DAX", "SQL"],
    "link": "https://app.powerbi.com/groups/me/reports/d6dab1e9-af48-490f-aa27-a67a6d144323/49522f18059986be774b?experience=power-bi"
  },
  {
    "title": "Maven Sales Dashboard",
    "description": " This project analyzes historical sales data for Maven Market (1997–1998), focusing on product performance and global store distribution. It visualizes key metrics such as revenue by product category, regional sales trends, and store presence across continents. The report provides insights into market penetration, product popularity, and geographic sales dynamics during the late 1990s",
    "tools": ["Power BI", "DAX", "Data Visualization"],
    "link": "https://app.powerbi.com/groups/me/reports/65ebd5ae-660a-4cb6-8324-4e46c3b10c16/f1149ff0aa97551b0709?experience=power-bi"
  }
]